function [q,qd,qdd]= fun_quintic_polynomial_interpolation(q0,q1,qd0,qd1,qdd0,qdd1,T,t)
    %给定初末位置、速度、加速度、总时间，返回五次插值后，在时间t（0<t<T）的位置、速度、加速度，t也可以是时间序列
    A=[0       0        0        0       0       1;
       T^5     T^4      T^3      T^2     T       1;
       0       0        0        0       1       0;
       5*T^4   4*T^3    3*T^2    2*T     1       0;
       0       0        0        2       0       0;
       20*T^3  12*T^2   6*T      2       0       0];
    B=[q0;q1;qd0;qd1;qdd0;qdd1];
    p=A\B;
    q=p(1,:)'*t.^5+p(2,:)'*t.^4+p(3,:)'*t.^3+p(4,:)'*t.^2+p(5,:)'*t+p(6,:)';
    qd=5*p(1,:)'*t.^4+4*p(2,:)'*t.^3+3*p(3,:)'*t.^2+2*p(4,:)'*t+p(5,:)';
    qdd=20*p(1,:)'*t.^3+12*p(2,:)'*t.^2+6*p(3,:)'*t+2*p(4,:)';
    end